# Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
# Требуется определить номер дня, на который общий результат спортсмена составить не менее b километров.
# Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.
# Например: a = 2, b = 3.


a = int(input('количество километров в первый день: '))
b = int(input('сколько километров хочет пробежать: '))
c = 0
while 1 > 0:
    # print(a)
    a = a * 1.1
    c = c + 1
    # print(c)
    if a > b * 1.1:
        break
print('Ответ: на %d -й день спортсмен достиг результата — не менее %d км.' % (c, b))
