# Пользователь вводит строку из нескольких слов, разделённых пробелами.
# Вывести каждое слово с новой строки.
# Строки необходимо пронумеровать.
# Если в слово длинное, выводить только первые 10 букв в слове.

# вариант без enumerate()
# s=input('строка из нескольких слов ')
# df=s.split(' ')
#
# for i in range(0,len(df)):
#     print(f'{i+1} {df[i]}')

# вариант c enumerate()
s=input('строка из нескольких слов ')
df=s.split(' ')

for i in enumerate(df, 1):
    print(i)

