# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

def year_time():
    mon = int (input ("вводит месяц в виде целого числа "))
    if mon > 12 or mon <= 0:
        year_time ()
    else:
        if 1 <= mon <= 2 or mon == 12:
            print ('зима')
        elif 3 <= mon <= 5:
            print ('весна')
        elif 6 <= mon <= 8:
            print ('лето')
        elif 9 <= mon <= 12:
            print ('осень')

year_time ()




