# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.


var1 = ['adsf', 2131, 2324.1]
var = ['fjsk', 234, var1, 324.2]
for i in var:
    print (type (var))
