
# Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя: имя, фамилия, год рождения,
# город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы.
# Реализовать вывод данных о пользователе одной строкой.




def user ():
    name,surname,year=input ("имя"),input ('фамилия'), int (input ('год рождения'))
    if year> 2021:
        print('ошибка')
        user()
    else:
        town, email= input ('город проживания'), input ('email')
    if email.find('@'):
        print (name, surname,year, town, email)
    else:
        user ()

user ()
