# Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.
while True:
    try:
        v_1,v_2=int(input()),int(input())
        def my_fun ():
            x = v_1 / v_2
            print (x)
        my_fun ()
        break
    except ZeroDivisionError:
        print('ошибка')






