# Реализовать функцию int_func(), принимающую слово из маленьких латинских букв и возвращающую его же,
# но с прописной первой буквой.
# Например, print(int_func(‘text’)) -> Text.

# Продолжить работу над заданием. В программу должна попадать строка из слов, разделенных пробелом.
# Каждое слово состоит из латинских букв в нижнем регистре.
# Сделать вывод исходной строки, но каждое слово должно начинаться с заглавной буквы.
# Необходимо использовать написанную ранее функцию int_func().



while True:
    word=str(input()).lower()
    word_sp=(','.join (word).split (','))
    alfabet_low =[chr (i) for i in range (97, 122)]
#
#     # тут должно идти сравнение и выявляться только ли латинские буквы нижнего регистра
#     # но ф-ция не очень работает (
#
    for i in range(1,len(word_sp)):
        if word_sp[i]==alfabet_low[i]:
            int_func()
        else:
            break
    if word_sp.index(' '): break


def int_func():
    word_title=word.title()
    return word_title
print(int_func())




