
# Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя: имя, фамилия, год рождения,
# город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы.
# Реализовать вывод данных о пользователе одной строкой.


a={'имя':'', 'фамилия':'', 'год':'','город проживания':'', 'email':'', 'телефон':''}
#
# for f in a.keys():
#     user=input(f'{f}: ')
#     numbers_user_data= if(user=='год') else user


def my_f (name,surname,year,town, email):






# def user ():
#     name,surname,year=input ("имя"),input ('фамилия'), int (input ('год рождения'))
#     if year> 2021:
#         print('ошибка')
#         user()
#     else:
#         town, email= input ('город проживания'), input ('email')
#     if email.find('@'):
#         print (name, surname,year, town, email)
#     else:
#         user ()
#
# user ()
