# Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
# практических и лабораторных занятий по этому предмету и их количество.
# Важно, чтобы для каждого предмета не обязательно были все типы занятий. Сформировать словарь,
# содержащий название предмета и общее количество занятий по нему. Вывести словарь на экран.
# Примеры строк файла:
# Информатика: 100(л) 50(пр) 20(лаб).
# Физика: 30(л) — 10(лаб)
# Физкультура: — 30(пр) —
#
# Пример словаря:
# {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}

# [int(s) for s in str.split() if s.isdigit()]

with open('task6_text.txt') as f:
    lines=f.readlines()
    for i in lines:
        print(i)
        ln = str (lines[i])
        a,b=ln.split(': ')
        print (b[b.index (' '):b.index ('(') + len (b)])


#     for i in range(len(lines)):
#         ln = str(lines[i])
#         a,b=ln.split(': ')
#         print(a)
#
#
# # for i in range():



    # theme,\
    # hours=a.split(': ')
    # print(hours)
    # for i in f:
    #     sp_l=i.split(': ')
    #     print(sp_l)
