# Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.

# Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.

from itertools import count,cycle

#первое задание


for i in count(int(input())):
    if i ==10:
        break
    print(i)

#второе задание

L=[i for i in range(1,10)]
I=cycle(L)
s=' '
while s!='q':
     X = next(I)
     print(X,end='')
     stop=input()