# Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск).
# Атрибут реализовать как приватный. В рамках метода реализовать переключение светофора в режимы: красный, желтый,
# зеленый. Продолжительность первого состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды, третьего
# (зеленый) — на ваше усмотрение. Переключение между режимами должно осуществляться только в указанном порядке (красный,
# желтый, зеленый). Проверить работу примера, создав экземпляр и вызвав описанный метод.

import time

class TrafficLight:
    def __init__(self):
        self.__colors = ['red','yellow','green']

    def running(self):
        for i in range(len(self.__colors)):
            # print(i)
            print (self.__colors[i])
            if i == 0:
                i=7
                time.sleep(i)
                i=0
            elif i == 1:
                i=2
                time.sleep(i)
                i=1
            elif i == 2:
                i = 3
                time.sleep (i)
                i=2

light = TrafficLight()
light.running()








