# Запросите у пользователя значения выручки и издержек фирмы. Определите, с каким финансовым результатом работает фирма
# (прибыль — выручка больше издержек, или убыток — издержки больше выручки). Выведите соответствующее сообщение.
# Если фирма отработала с прибылью, вычислите рентабельность выручки (соотношение прибыли к выручке).
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.


proceeds = int(input('выручка: '))
cost = int(input('издержки: '))

if proceeds > cost:
    humans = int(input('количесво сотрудников: '))
    print('прибыль — выручка больше издержек')
    profit = proceeds - cost
    proc_prof = proceeds / profit
    prof_hum = profit / humans
    print('рентабельность выручки %d' % proc_prof)
    print('прибыль фирмы в расчете на одного сотрудника %d' % (prof_hum))
else:
    print('убыток — издержки больше выручки')
